Revit 2026 API

# RebarSpliceSpliceTypeId Property

---

Identifies the id of the Rebar Splice Type.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId SpliceTypeId { get; set; }
```
```vb
Public Property SpliceTypeId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ SpliceTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member SpliceTypeId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The provided id doesn't represent a valid Rebar Splice Type. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Interactions with Rebar Splice Types can be done with the functions in RebarSpliceTypeUtils.

#### Reference

RebarSplice Class

Autodesk.Revit.DB.Structure Namespace